# Предисловие
Данная программа является контрольной работой для GeekBrains по курсу "Разработчик" после первой четверти обучения.

# Описание программы
Программа получает на вход массив строк, которые вводит пользователь. После программа генерирует  новый массив строк из строк, которые содержат в себе 3 и меньше символа. И выводит новый массив на экран.

# Решение задачи
1) Мною было принято решение, чтобы пользователь мог самостоятельно ввести массив строк, который будет отсортирован. Изначально, для решения этой подзадачи, необходимо запросить у пользователя какой длины будет массив. 
    
        int.TryParse(Console.ReadLine(), out int num);
        while (num <= 0)
        {
            Console.WriteLine("Число меньше 1! Невозможно создать массив. Введите заново: ");
            int.TryParse(Console.ReadLine(), out num);
        }
    Для корректности ввода размера массива используется int.TryParse и цикл с условием, что полученно число <= 0 (массив на 0 элементов существовать может, но смысла от него мало, поэтому ограничивать условием строго больше 0 не стал).
2.  После получения размера изначального массива от пользователя, программа переходит к заполнению этого массива отдельным методом.

        string[] userArray = UserInputArray(num);

        string[] UserInputArray(int num)
        {
            string[] array = new string[num];
            for (int i = 0; i < array.Length; i++)
            {
                Console.Write($"Введите строку №{i}: ");
                array[i] = Console.ReadLine()!;
            }
            return array;
        }
    Здесь метод получает на вход целое число, которое было введено пользователем ранее, и поэлементно запрашивает ввод каждой новой строки.

    В цикле после Console.Readline() стоит восклицательный знак "!". Он нужен для того, чтобы не проводить проверку на null-строку, поскольку, на мой взгляд, получить её из консольного ввода невозможно. Вместо этого будет получена пустая строка, что является корректным значением для массива.
    После выполнения, метод возвращает заполненный пользователем массив строк.

    Каждая строка считывается программа по нажатю клавиши Enter.


3. Заполненный массив строк передаётся в новый метод, где будет создан новый массив меньшего или такого же размера, заполненный элементами массива 3 и менее символами.

        string[] threeCharArray = ThreeCharArray(userArray);

        string[] ThreeCharArray(string[] userArray)
        {
            int count = 0;
            for (int i = 0; i < userArray.Length; i++)
            {
                if (userArray[i].Length <= 3)
                    count++;
            }

            string[] finishArray = new string[count];
            count = 0;
            for (int i = 0; i < userArray.Length; i++)
            {
                if (userArray[i].Length <= 3)
                {
                    finishArray[count] = userArray[i];
                    count++;
                }
            }    
            return finishArray;
        }
    В методе используется два одинаковых цикла.

    Первый цикл нужен для подсчёта количества элементов изначального массива, в которых 3 и меньше символа.
    
    После пересчёта создаётся новый массив finishArray. Далее, в следующем цикле, происходит его заполнение строками на 3 и меньше символа.

    Метод возвращает новый массив.

4. Последнее, что делает программа, она печатает в отформатированном виде массив пользователя и новый массив из 3 и меньше символов. Для этого используется один метод с разными аргументами.

        Console.WriteLine("Изначальный массив:");
        PrintArray(userArray);
        Console.WriteLine("Полученный массив:");
        PrintArray(threeCharArray);

        void PrintArray(string[] printArr)
        {
            Console.Write("[");
            for (int i = 0; i < printArr.Length; i++)
            {
                if (i == printArr.Length - 1)
                    Console.Write($"\"{printArr[i]}\"");
                else
                    Console.Write($"\"{printArr[i]}\", ");
            }
            Console.WriteLine("]");
        }

    В методе также, как и в предыдущих, используется цикл для отображения всех элементов. Каждый элемент массива заключается с двух сторон в символ "кавычки", и после них в конце слова ставится "запятая" и "пробел" (за исключением последнего элемента).
    
    Вне цикла ставятся квадратные открывающая и закрывающая скобки.

    Метод ничего не возвращает.
5. В конце выводится метод с указанием авторства.

# Выполнение программы в консоли

## Этап 1
    Программа запрашивает от пользователя массив строк.
    Выводит все строки состоящие из 3 и меньше символов в новый массив.
    Сколько будет строк в изначальном массиве?
    >>:

## Этап 2
    >>: 5
    Введите строку №0: hello
    Введите строку №1: 2
    Введите строку №2: world
    Введите строку №3: :-)
    Введите строку №4: GeekBrains

## Этап 3
    Изначальный массив:
    ["hello", "2", "world", ":-)", "GeekBrains"]
    Полученный массив:
    ["2", ":-)"]

    Программа создана Te3Ka_PaynE.
    E-mail: Mnement4813@yandex.ru